package com.chy.innerclass_.introduce_innerclass;

public class InnerClass01 {
    public static void main(String[] args) {
        /*
        * 内部类介绍：
        *   一个类的内部又完整的嵌套了另一个类结构，被嵌套的类成为内部类(inner class)
        *   嵌套其他类的类称为外部类(outer class)。是我们类的第五大成员
        * 思考：类的五大成员一共有哪些:
        *   1、成员属性
        *   2、成员方法
        *   3、构造器
        *   4、代码块
        *   5、内部类
        *   内部类的最大特点就是可以直接访问私有属性，并且可以体现类与类之间的包含关系
        *  注意：
        *   内部类学习的难点，同时也是重点，后面看底层源码时，会有大量的内部类
        * */


        /*
        * 内部类的分类：(4种内部类)
        *   1、定义在外部类局部位置上(比如方法内)：
        *       1.1、局部内部类(有类名)
        *       1.2、匿名内部类(没有类名，重点！！！！！！)
        *   2、定义在外部类的成员位置上：
        *       2.1、成员内部类(没有用static修饰)
        *       2.2、静态内部类(使用static修饰)
        * */
    }
}
